[
	{
		"id": "1",
		"name": "Adobo",
		"category_group": "Filipino",
		"category": "Main Course",
		"origin": "Philippines",
		"description": "Adobo is often called the unofficial national dish of the Philippines. It features meat—commonly chicken or pork—braised gently in a savory-sour sauce of vinegar, soy sauce, garlic, peppercorns, and bay leaves. The cooking method preserves and tenderizes the meat, yielding deep flavors and a glossy reduction. Adobo’s adaptability spans regional variations, families’ secret ratios, and diverse proteins, reflecting the archipelago’s culinary ingenuity and practical preservation traditions.",
		"ingredients": ["chicken or pork", "soy sauce", "cane vinegar", "garlic", "bay leaves", "black peppercorns", "onion", "oil"],
		"preparation_method": "Marinate protein with soy, vinegar, garlic, and spices. Sauté aromatics, add marinated meat and marinade, then simmer until tender. Reduce sauce until glossy. Optionally pan-fry meat for caramelized edges and serve with steamed rice.",
		"nutritional_highlights": "Protein-rich with modest fat; vinegar and garlic provide antimicrobial compounds; choose lean cuts and moderate sodium to keep it heart-friendly.",
		"cultural_significance": "Adobo embodies resourcefulness, using vinegar for preservation in tropical climates. It symbolizes home-style comfort across islands and diasporic communities.",
		"dietary_classifications": ["gluten-free (with GF soy)", "dairy-free"]
	},
	{
		"id": "2",
		"name": "Sinigang",
		"category_group": "Filipino",
		"category": "Soup",
		"origin": "Philippines",
		"description": "Sinigang is a tangy Filipino soup celebrated for its bright, refreshing sourness, traditionally derived from tamarind, green mango, or calamansi. It balances acidity with savory depth from fish, pork, shrimp, or beef, plus an abundance of vegetables like kangkong, radish, and okra. Served piping hot with rice, sinigang is cherished as rainy-day comfort and a palate-cleansing everyday staple that showcases local produce and regional souring agents.",
		"ingredients": ["tamarind", "pork or shrimp", "tomato", "onion", "kangkong (water spinach)", "radish", "okra", "green chili", "fish sauce"],
		"preparation_method": "Simmer protein with aromatics. Add tamarind broth and vegetables in stages to keep textures crisp-tender. Season with fish sauce and adjust sourness to taste.",
		"nutritional_highlights": "Hydrating, vitamin-rich from diverse vegetables; lean proteins add satiety; lower sodium versions support cardiovascular health.",
		"cultural_significance": "Sinigang reflects regional identity via varied souring agents and local greens, embodying a Filipino love for bright, balanced flavors.",
		"dietary_classifications": ["gluten-free", "dairy-free"]
	},
	{
		"id": "3",
		"name": "Kare-Kare",
		"category_group": "Filipino",
		"category": "Stew",
		"origin": "Philippines",
		"description": "Kare-Kare is a luxurious peanut-based stew famed for its velvety sauce and tender meats such as oxtail or beef tripe. Annatto lends a warm hue while vegetables like banana blossoms, eggplant, and string beans add texture. It is traditionally served with bagoong (fermented shrimp paste) to amplify umami. Rich and ceremonial, Kare-Kare graces festive tables and highlights precolonial ingredients and complex indigenous flavor layering.",
		"ingredients": ["oxtail or beef", "peanut butter or ground peanuts", "annatto seeds", "banana blossoms", "eggplant", "string beans", "bok choy", "garlic", "onion", "bagoong"],
		"preparation_method": "Simmer meat until gelatinous and tender. Prepare peanut-annatto sauce, then add vegetables to cook gently. Serve with bagoong on the side for seasoning to taste.",
		"nutritional_highlights": "High in protein and collagen; peanuts add healthy fats and vitamin E; moderation advised due to sodium and richness.",
		"cultural_significance": "A celebration dish often reserved for gatherings, Kare-Kare symbolizes abundance and communal dining.",
		"dietary_classifications": ["dairy-free"]
	},
	{
		"id": "4",
		"name": "Lechon",
		"category_group": "Filipino",
		"category": "Roast",
		"origin": "Philippines",
		"description": "Lechon is whole roasted pig, an icon of Filipino festivities marked by crisp lacquered skin and succulent meat. Traditionally roasted over charcoal, it is seasoned with aromatics like lemongrass, garlic, and pepper. The skillful slow roasting creates textural contrasts and a celebratory centerpiece. Variations exist across regions, including unique dips and stuffing. Lechon encapsulates communal feasting, culinary craftsmanship, and a spirit of generosity.",
		"ingredients": ["whole pig", "lemongrass", "garlic", "salt", "pepper", "soy sauce", "vinegar"],
		"preparation_method": "Season cavity with aromatics. Truss and slow-roast over charcoal, basting to achieve crisp skin and juicy meat. Rest before carving and serve with liver sauce or vinegar dip.",
		"nutritional_highlights": "High protein and fat; choose lean portions and pair with vegetables to balance indulgence; mindful portions recommended.",
		"cultural_significance": "A centerpiece for fiestas and milestones, Lechon signifies prosperity, craftsmanship, and community bonding.",
		"dietary_classifications": ["dairy-free", "gluten-free (without soy)"]
	},
	{
		"id": "5",
		"name": "Pancit Canton",
		"category_group": "Filipino",
		"category": "Noodles",
		"origin": "Philippines",
		"description": "Pancit Canton features stir-fried wheat noodles tossed with meat or seafood and crisp vegetables in a savory sauce. Influenced by Chinese culinary traditions, it evolved into a Filipino crowd-pleaser served at birthdays for long-life symbolism. The dish’s flexibility encourages household improvisation with available ingredients, making it a beloved, flavorful, and practical staple across home kitchens and casual eateries.",
		"ingredients": ["egg noodles", "chicken or pork", "shrimp", "cabbage", "carrots", "bell peppers", "soy sauce", "oyster sauce", "garlic", "onion"],
		"preparation_method": "Sauté aromatics, add proteins, then vegetables. Toss in blanched noodles with soy-oyster sauce until well coated. Finish with pepper and calamansi.",
		"nutritional_highlights": "Balanced carbs, proteins, and fiber; choose lean meats and extra vegetables to boost micronutrients.",
		"cultural_significance": "Often served at celebrations as a symbol of longevity, linking Filipino festivities to shared heritage and Chinese influences.",
		"dietary_classifications": ["contains gluten"]
	},
	{
		"id": "6",
		"name": "Halo-Halo",
		"category_group": "Filipino",
		"category": "Dessert",
		"origin": "Philippines",
		"description": "Halo-Halo is a vibrant Filipino shaved ice dessert layering sweetened fruits, jellies, beans, and custards, topped with leche flan and ube ice cream. Its name means “mix-mix,” inviting joyful customization. The medley of textures and colors celebrates tropical abundance and postwar ingenuity. Served in tall glasses, it’s a refreshing escape from heat and a playful tribute to Filipino resourcefulness and nostalgia.",
		"ingredients": ["shaved ice", "evaporated milk", "sweetened saba bananas", "sweet beans", "nata de coco", "gulaman", "ube halaya", "leche flan", "ice cream"],
		"preparation_method": "Layer sweet preserves and jellies in a glass, add shaved ice, pour milk, and crown with flan and ube ice cream. Mix before eating.",
		"nutritional_highlights": "Energy-dense dessert; beans add fiber and plant protein; enjoy in moderation and consider reduced sugar versions.",
		"cultural_significance": "A joyful symbol of Filipino creativity and postwar fusion of ingredients, popular in summer and street stalls.",
		"dietary_classifications": ["vegetarian"]
	},
	{
		"id": "7",
		"name": "Laing",
		"category_group": "Filipino",
		"category": "Vegetable Dish",
		"origin": "Bicol Region, Philippines",
		"description": "Laing is a Bicolano specialty of dried taro leaves simmered in coconut milk with chilies, aromatics, and sometimes dried fish or pork. Creamy and spicy, it showcases the region’s love for gata (coconut milk) and heat. The dish delivers earthy flavors and a satisfying richness balanced by gentle burn, reflecting agricultural roots and coastal influences in Bicol cuisine.",
		"ingredients": ["dried taro leaves", "coconut milk", "chilies", "garlic", "ginger", "onion", "dried fish or pork (optional)", "shrimp paste (optional)"],
		"preparation_method": "Simmer coconut milk with aromatics and chilies, add taro leaves without stirring initially to avoid itchiness, then cook gently until tender and creamy.",
		"nutritional_highlights": "Coconut milk provides medium-chain triglycerides; taro leaves offer fiber and micronutrients; manage portion size due to richness.",
		"cultural_significance": "Laing reflects Bicol’s hallmark pairing of coconut milk and chilies, tying cuisine to local crops and coastal trade.",
		"dietary_classifications": ["gluten-free", "can be pescatarian or vegetarian"]
	},
	{
		"id": "8",
		"name": "Bibingka",
		"category_group": "Filipino",
		"category": "Rice Cake",
		"origin": "Philippines",
		"description": "Bibingka is a traditional rice cake baked in clay ovens lined with banana leaves, especially popular during Christmas dawn masses. Made from rice flour, coconut milk, and sugar, it is often topped with salted egg and cheese for sweet-salty contrast. Its aroma and gentle crust evoke festive warmth, community, and devotion, marking cherished holiday rituals across generations.",
		"ingredients": ["rice flour", "coconut milk", "sugar", "eggs", "salted egg", "cheese", "banana leaves"],
		"preparation_method": "Prepare batter, line mold with banana leaves, pour and bake until set with a lightly charred top. Top with salted egg and cheese.",
		"nutritional_highlights": "Carbohydrate-rich; coconut milk adds fats; pairing with tea or fruit can moderate glycemic load.",
		"cultural_significance": "A Christmas staple, Bibingka symbolizes togetherness after Simbang Gabi and the comforting flavors of the season.",
		"dietary_classifications": ["vegetarian", "gluten-free"]
	},
	{
		"id": "9",
		"name": "Chicken Inasal",
		"category_group": "Filipino",
		"category": "Grilled",
		"origin": "Western Visayas, Philippines",
		"description": "Chicken Inasal is a beloved grilled chicken from Bacolod marinated in calamansi, vinegar, lemongrass, and achiote oil. It is basted while grilling to achieve smoky char and vibrant color. Served with garlic rice and dipping sauces, Inasal spotlights regional citrus, grilling culture, and the convivial spirit of outdoor dining.",
		"ingredients": ["chicken", "calamansi", "vinegar", "lemongrass", "garlic", "ginger", "achiote oil", "salt", "pepper"],
		"preparation_method": "Marinate chicken with citrus and aromatics, then grill over medium heat while basting with achiote oil until cooked through and lightly charred.",
		"nutritional_highlights": "Lean protein with minimal added fat; citrus marinade may reduce formation of certain grilling byproducts.",
		"cultural_significance": "A hallmark of Bacolod, often enjoyed in open-air eateries and family gatherings.",
		"dietary_classifications": ["gluten-free", "dairy-free"]
	},
	{
		"id": "10",
		"name": "Taho",
		"category_group": "Filipino",
		"category": "Snack/Breakfast",
		"origin": "Philippines",
		"description": "Taho is a comforting street breakfast made of warm silken tofu layered with arnibal (caramelized brown sugar syrup) and sago pearls. Vendors call out in the mornings, serving it in cups to commuters and children. Soft, sweet, and protein-friendly, taho blends Chinese culinary lineage with Filipino street culture, providing gentle nourishment and nostalgia.",
		"ingredients": ["silken tofu", "brown sugar", "water", "vanilla", "sago pearls"],
		"preparation_method": "Prepare arnibal syrup, cook sago until translucent, and assemble warm tofu with syrup and pearls in cups.",
		"nutritional_highlights": "Plant protein from soy; lower-fat, calcium-fortified versions increase bone health benefits; adjust sugar to taste.",
		"cultural_significance": "Morning street vendors symbolize routine and community ties in urban neighborhoods.",
		"dietary_classifications": ["vegan", "gluten-free"]
	},

	{
		"id": "11",
		"name": "Quinoa Kale Bowl",
		"category_group": "Healthy",
		"category": "Healthy Bowl",
		"origin": "Modern Fusion",
		"description": "A balanced bowl combining fluffy quinoa, massaged kale, roasted chickpeas, avocado, and lemon-tahini dressing. The dish emphasizes nutrient density, plant proteins, and fiber for satiety and metabolic support. Its versatility suits meal prep and varied dietary needs, showcasing contemporary nutrition-forward cooking with vibrant textures and clean flavors.",
		"ingredients": ["quinoa", "kale", "chickpeas", "avocado", "lemon", "tahini", "olive oil", "garlic"],
		"preparation_method": "Cook quinoa, roast seasoned chickpeas, massage kale with lemon and oil, then assemble with avocado and drizzle dressing.",
		"nutritional_highlights": "High fiber, complete plant protein (quinoa), healthy fats; supports glycemic control and micronutrient diversity (folate, magnesium).",
		"cultural_significance": "Reflects modern wellness cuisine and flexible dietary patterns.",
		"dietary_classifications": ["vegan", "gluten-free"]
	},
	{
		"id": "12",
		"name": "Grilled Salmon with Broccolini",
		"category_group": "Healthy",
		"category": "Healthy Main",
		"origin": "Contemporary",
		"description": "This dish pairs omega-3-rich salmon with lightly charred broccolini, finished with lemon zest and olive oil. The preparation prioritizes gentle heat to preserve nutrients and maintain a moist interior. It’s a simple, elegant plate that supports cardiovascular health and offers a satisfying protein profile with minimal processing.",
		"ingredients": ["salmon fillet", "broccolini", "olive oil", "lemon", "garlic", "salt", "pepper"],
		"preparation_method": "Season salmon and grill skin-side down until crisp; blanch and sauté broccolini with garlic and lemon.",
		"nutritional_highlights": "Omega-3 fatty acids, vitamin C, fiber, and high-quality protein; low in refined carbohydrates.",
		"cultural_significance": "Highlights global interest in heart-healthy, whole-food cooking.",
		"dietary_classifications": ["gluten-free", "pescatarian"]
	},
	{
		"id": "13",
		"name": "Lentil and Vegetable Stew",
		"category_group": "Healthy",
		"category": "Healthy Stew",
		"origin": "Mediterranean-inspired",
		"description": "A hearty stew of green lentils, tomatoes, carrots, celery, and spinach simmered with herbs. It delivers rich plant protein and iron with slow-release carbohydrates. The dish provides comfort and sustained energy while staying budget-friendly, making it ideal for home cooks seeking nutritious, everyday meals.",
		"ingredients": ["green lentils", "tomatoes", "carrots", "celery", "spinach", "onion", "garlic", "olive oil", "thyme"],
		"preparation_method": "Sauté aromatics, add lentils and tomatoes, simmer until tender, fold in spinach and herbs before serving.",
		"nutritional_highlights": "High fiber, plant protein, iron, folate; supports digestive health and satiety.",
		"cultural_significance": "Echoes Mediterranean home cooking focused on legumes and vegetables.",
		"dietary_classifications": ["vegan", "gluten-free"]
	},
	{
		"id": "14",
		"name": "Greek Yogurt Parfait",
		"category_group": "Healthy",
		"category": "Healthy Breakfast",
		"origin": "Greek-inspired",
		"description": "Layered Greek yogurt, berries, nuts, and a drizzle of honey form a quick breakfast rich in protein and antioxidants. The contrasting textures and natural sweetness support a satisfying start, while portion control helps maintain balance. It’s adaptable with seasonal fruits and seeds for micronutrient variety.",
		"ingredients": ["Greek yogurt", "mixed berries", "almonds or walnuts", "honey", "chia seeds"],
		"preparation_method": "Layer yogurt with berries and nuts; finish with honey and seeds.",
		"nutritional_highlights": "High protein and probiotics, polyphenols from berries, healthy fats; supports gut health and muscle maintenance.",
		"cultural_significance": "Draws on Greek dairy traditions and modern breakfast trends.",
		"dietary_classifications": ["vegetarian", "gluten-free"]
	},
	{
		"id": "15",
		"name": "Tofu Stir-Fry with Brown Rice",
		"category_group": "Healthy",
		"category": "Healthy Main",
		"origin": "Asian-inspired",
		"description": "Crisp tofu cubes tossed with a rainbow of vegetables, ginger, and light soy sauce over brown rice. It emphasizes plant protein and whole grains, delivering fiber and micronutrients in a convenient, customizable meal. Quick cooking preserves texture and color while keeping the preparation approachable for weeknights.",
		"ingredients": ["firm tofu", "broccoli", "bell peppers", "snap peas", "carrots", "ginger", "garlic", "low-sodium soy sauce", "brown rice"],
		"preparation_method": "Press and sear tofu, stir-fry vegetables on high heat, add sauce, and serve over steamed brown rice.",
		"nutritional_highlights": "Complete meal with plant protein, fiber, vitamins A and C; lower sodium option supports blood pressure.",
		"cultural_significance": "Reflects pan-Asian stir-fry techniques and whole-grain wellness.",
		"dietary_classifications": ["vegan", "contains soy", "contains gluten (soy sauce)"]
	},
	{
		"id": "16",
		"name": "Chickpea and Avocado Salad",
		"category_group": "Healthy",
		"category": "Healthy Salad",
		"origin": "Modern Fusion",
		"description": "A fresh salad combining chickpeas, avocado, cucumber, tomatoes, and herbs with lemon-olive oil dressing. It’s rich in fiber and unsaturated fats that support heart health and satiety. The dish travels well, suits meal prep, and pairs with whole grains for a complete lunch.",
		"ingredients": ["chickpeas", "avocado", "cucumber", "tomatoes", "red onion", "parsley", "lemon", "olive oil"],
		"preparation_method": "Toss ingredients with dressing and season to taste.",
		"nutritional_highlights": "Plant protein, fiber, potassium, folate; supports blood sugar regulation and fullness.",
		"cultural_significance": "Adopts Mediterranean pantry staples in modern salad culture.",
		"dietary_classifications": ["vegan", "gluten-free"]
	},
	{
		"id": "17",
		"name": "Baked Sweet Potato with Cottage Cheese",
		"category_group": "Healthy",
		"category": "Healthy Snack/Light Meal",
		"origin": "Contemporary",
		"description": "A simple, satisfying combination of oven-baked sweet potato topped with cottage cheese, chives, and pepper. The pairing provides slow-release carbohydrates and high-quality dairy protein, supporting recovery and satiety. It’s versatile with optional toppings like spinach or seeds for added nutrients.",
		"ingredients": ["sweet potato", "cottage cheese", "chives", "black pepper", "olive oil"],
		"preparation_method": "Bake sweet potato until tender, split, and top with cottage cheese and seasonings.",
		"nutritional_highlights": "Beta-carotene, fiber, calcium, and protein; favorable for eye health and muscle maintenance.",
		"cultural_significance": "Reflects modern emphasis on whole-food convenience and nutrient density.",
		"dietary_classifications": ["gluten-free", "vegetarian"]
	},
	{
		"id": "18",
		"name": "Spinach and Mushroom Omelet",
		"category_group": "Healthy",
		"category": "Healthy Breakfast",
		"origin": "European-inspired",
		"description": "A fluffy omelet filled with sautéed mushrooms and spinach provides protein, B vitamins, and iron. Quick cooking helps retain moisture and a tender texture. Pairing with whole-grain toast yields a balanced breakfast suitable for busy mornings.",
		"ingredients": ["eggs", "spinach", "mushrooms", "milk (optional)", "salt", "pepper", "olive oil"],
		"preparation_method": "Sauté mushrooms and spinach, pour beaten eggs, cook gently, fold, and serve.",
		"nutritional_highlights": "High protein, choline, iron, and antioxidants; satisfies hunger and supports cognitive function.",
		"cultural_significance": "Common across European cafes and home kitchens.",
		"dietary_classifications": ["gluten-free", "vegetarian"]
	},
	{
		"id": "19",
		"name": "Berry Oat Smoothie",
		"category_group": "Healthy",
		"category": "Healthy Beverage",
		"origin": "Contemporary",
		"description": "A blended smoothie of mixed berries, oats, yogurt or plant milk, and flaxseed offers a portable breakfast packed with fiber and polyphenols. It supports digestive health and sustained energy, ideal for active lifestyles and quick nutrition.",
		"ingredients": ["mixed berries", "rolled oats", "yogurt or plant milk", "flaxseed", "banana (optional)"],
		"preparation_method": "Blend all ingredients until smooth; adjust thickness with liquid.",
		"nutritional_highlights": "Fiber, omega-3 from flax, antioxidants; supports gut microbiota and recovery.",
		"cultural_significance": "Represents the rise of on-the-go wellness beverages.",
		"dietary_classifications": ["vegetarian", "can be vegan", "gluten-free (GF oats)"]
	},
	{
		"id": "20",
		"name": "Roasted Beet and Goat Cheese Salad",
		"category_group": "Healthy",
		"category": "Healthy Salad",
		"origin": "European-inspired",
		"description": "Earthy roasted beets paired with tangy goat cheese, arugula, and walnuts dressed in balsamic showcase complementary flavors and textures. The dish provides antioxidants, healthy fats, and a moderate protein boost. It’s elegant yet easy, suitable for lunches or starters.",
		"ingredients": ["beets", "goat cheese", "arugula", "walnuts", "balsamic vinegar", "olive oil"],
		"preparation_method": "Roast beets until tender, slice, and toss with greens, nuts, and dressing; crumble cheese on top.",
		"nutritional_highlights": "Nitrates for vascular health, vitamin K, omega-3 ALA from walnuts; supports circulation and cognition.",
		"cultural_significance": "A bistro classic reflecting European salad traditions.",
		"dietary_classifications": ["vegetarian", "gluten-free"]
	},
	{
		"id": "21",
		"name": "Miso Soup with Seaweed and Tofu",
		"category_group": "Healthy",
		"category": "Healthy Soup",
		"origin": "Japanese-inspired",
		"description": "A light broth of dashi and miso paste with tofu cubes and wakame seaweed offers umami depth and gentle nourishment. It’s low-calorie yet mineral-rich, often enjoyed as a starter that aids digestion and provides comfort.",
		"ingredients": ["miso paste", "dashi", "tofu", "wakame", "green onions"],
		"preparation_method": "Heat dashi, dissolve miso off-heat, add tofu and rehydrated wakame; finish with scallions.",
		"nutritional_highlights": "Iodine, protein, probiotics (in some miso), and low calories; supports thyroid and gut health.",
		"cultural_significance": "Reflects everyday Japanese meals emphasizing balance and umami.",
		"dietary_classifications": ["vegan (if using kombu-shiitake dashi)", "gluten-free (with GF miso)"]
	},

	{
		"id": "22",
		"name": "Margherita Pizza",
		"category_group": "International",
		"category": "Main Course",
		"origin": "Italy",
		"description": "Margherita Pizza showcases the Italian triad of fresh tomatoes, mozzarella, and basil on a thin crust. Baked at high heat, it achieves blistered edges and a tender center. The simplicity foregrounds ingredient quality and technique, making it an international favorite and a benchmark of Neapolitan pizza craft.",
		"ingredients": ["pizza dough", "tomato sauce", "fresh mozzarella", "basil", "olive oil", "salt"],
		"preparation_method": "Stretch dough, spread sauce, add mozzarella, bake on a stone at high heat until leopard spotting appears; finish with basil and oil.",
		"nutritional_highlights": "Moderate protein and calcium; opt for whole-grain dough and light cheese for better balance.",
		"cultural_significance": "A symbol of Naples and Italian culinary minimalism, widely celebrated worldwide.",
		"dietary_classifications": ["vegetarian", "contains gluten"]
	},
	{
		"id": "23",
		"name": "Sushi (Nigiri and Maki)",
		"category_group": "International",
		"category": "Main Course",
		"origin": "Japan",
		"description": "Sushi pairs vinegared rice with seafood or vegetables, formed as nigiri (hand-pressed) or maki (rolled). Respect for ingredient freshness, knife skills, and rice seasoning define the craft. Techniques range from simple home rolls to refined omakase, making sushi a global icon of precision and subtlety.",
		"ingredients": ["sushi rice", "rice vinegar", "nori", "fresh fish or vegetables", "soy sauce", "wasabi"],
		"preparation_method": "Cook and season rice, prepare fillings, shape nigiri or roll maki, slice cleanly, and serve with condiments.",
		"nutritional_highlights": "Lean protein, omega-3s, iodine; balance sodium and choose sustainable seafood.",
		"cultural_significance": "Represents Japanese craftsmanship and seasonality, influencing global dining culture.",
		"dietary_classifications": ["pescatarian", "gluten-free (without soy)"]
	},
	{
		"id": "24",
		"name": "Tacos al Pastor",
		"category_group": "International",
		"category": "Street Food",
		"origin": "Mexico",
		"description": "Tacos al Pastor feature marinated pork roasted on a vertical spit, inspired by Lebanese shawarma, served on corn tortillas with pineapple, onion, and cilantro. Smoky, sweet, and savory, they embody Mexico’s street food dynamism and culinary fusion.",
		"ingredients": ["pork", "achiote", "chilies", "pineapple", "onion", "cilantro", "corn tortillas"],
		"preparation_method": "Marinate pork, roast on spit or grill, slice thin, and assemble on tortillas with toppings.",
		"nutritional_highlights": "Protein-rich; choose corn tortillas for gluten-free; balance with vegetables and mindful sodium.",
		"cultural_significance": "A beloved urban staple showcasing immigrant influences and local flair.",
		"dietary_classifications": ["dairy-free", "gluten-free (corn tortillas)"]
	},
	{
		"id": "25",
		"name": "Butter Chicken (Murgh Makhani)",
		"category_group": "International",
		"category": "Main Course",
		"origin": "India",
		"description": "Butter Chicken is a creamy tomato-based curry with tender tandoori chicken pieces finished in butter and cream. Its velvety sauce balances aromatic spices and gentle heat, appealing widely to international palates. The dish exemplifies North Indian restaurant classics and the technique of layering flavors.",
		"ingredients": ["chicken", "tomatoes", "cream", "butter", "garam masala", "ginger", "garlic", "kasuri methi"],
		"preparation_method": "Marinate chicken in yogurt and spices, grill, then simmer in tomato-cream sauce flavored with butter and fenugreek.",
		"nutritional_highlights": "High protein; rich in fat and calories—moderate portions and lighter dairy improve balance.",
		"cultural_significance": "An international Indian restaurant staple bridging traditional techniques and modern tastes.",
		"dietary_classifications": ["gluten-free", "contains dairy"]
	},
	{
		"id": "26",
		"name": "Pad Thai",
		"category_group": "International",
		"category": "Noodles",
		"origin": "Thailand",
		"description": "Pad Thai stir-fries rice noodles with eggs, tofu, shrimp, tamarind, fish sauce, and palm sugar, garnished with peanuts and lime. Balancing sweet, sour, salty, and umami, it’s a street food classic turned global favorite, demonstrating Thailand’s flavor harmony and wok technique.",
		"ingredients": ["rice noodles", "eggs", "tofu", "shrimp", "tamarind paste", "fish sauce", "palm sugar", "bean sprouts", "peanuts"],
		"preparation_method": "Soak noodles, stir-fry aromatics and proteins, add sauce and noodles, toss quickly, and finish with sprouts and peanuts.",
		"nutritional_highlights": "Balanced macronutrients; use less sugar and more vegetables for a lighter profile.",
		"cultural_significance": "A hallmark of Thai street cuisine and national identity.",
		"dietary_classifications": ["contains eggs", "gluten-free (with GF fish sauce)"]
	},
	{
		"id": "27",
		"name": "Peking Duck",
		"category_group": "International",
		"category": "Main Course",
		"origin": "China",
		"description": "Peking Duck features meticulously roasted duck with crisp, lacquered skin served with thin pancakes, scallions, and hoisin. The preparation includes air-drying and glazing for texture contrast. It’s a ceremonial dish reflecting imperial heritage and refined roasting craft.",
		"ingredients": ["duck", "maltose or honey", "soy sauce", "five-spice", "scallions", "cucumbers", "pancakes", "hoisin"],
		"preparation_method": "Inflate and air-dry duck, glaze, roast until skin is crisp, carve, and serve with accompaniments.",
		"nutritional_highlights": "Protein-rich; higher fat from skin—enjoy with vegetables and moderate sauces.",
		"cultural_significance": "An emblem of Beijing cuisine and banquet culture.",
		"dietary_classifications": ["contains gluten (pancakes/hoisin)"]
	},
	{
		"id": "28",
		"name": "Coq au Vin",
		"category_group": "International",
		"category": "Stew",
		"origin": "France",
		"description": "Coq au Vin braises chicken in red wine with mushrooms, lardons, and aromatics, yielding a deep, glossy sauce and tender meat. The technique exemplifies French country cooking, elevating humble ingredients through time and patience. It’s a comfort classic cherished worldwide.",
		"ingredients": ["chicken", "red wine", "mushrooms", "lardons", "onion", "garlic", "thyme"],
		"preparation_method": "Marinate poultry in wine, sear, sauté aromatics, then braise slowly; finish with beurre manié if desired.",
		"nutritional_highlights": "Protein-rich; moderate fat; wine antioxidants present but reduced by cooking.",
		"cultural_significance": "Embodies French rustic elegance and slow-cooking traditions.",
		"dietary_classifications": ["contains pork (traditional)", "gluten-free (without thickener)"]
	},
	{
		"id": "29",
		"name": "Fish and Chips",
		"category_group": "International",
		"category": "Main Course",
		"origin": "United Kingdom",
		"description": "Battered and fried white fish served with thick-cut fried potatoes and malt vinegar. Crisp freshness relies on hot oil and quality batter. A seaside staple and national comfort, it reflects industrial-era street food and enduring pub culture.",
		"ingredients": ["white fish", "flour", "beer or soda water", "salt", "potatoes", "oil"],
		"preparation_method": "Prepare batter, coat fish, deep-fry until golden; fry chips separately and season with salt and vinegar.",
		"nutritional_highlights": "High energy; provides protein; baking alternatives reduce fat; include peas for fiber.",
		"cultural_significance": "Iconic British fare tied to coastal towns and pub dining.",
		"dietary_classifications": ["contains gluten", "pescatarian"]
	},
	{
		"id": "30",
		"name": "Falafel Wrap",
		"category_group": "International",
		"category": "Street Food",
		"origin": "Middle East",
		"description": "Falafel are spiced chickpea fritters served in flatbread with tahini, pickles, and salad. Crispy outside and tender inside, they showcase legumes and herbs. Widely adopted internationally, falafel represent plant-based street food heritage.",
		"ingredients": ["chickpeas", "parsley", "cilantro", "onion", "garlic", "cumin", "coriander", "tahini", "flatbread"],
		"preparation_method": "Soak and grind chickpeas with herbs and spices, shape balls, fry until golden, assemble in wrap with tahini and vegetables.",
		"nutritional_highlights": "Plant protein, fiber, micronutrients; baking reduces oil; tahini adds calcium.",
		"cultural_significance": "A vegetarian staple across Levantine street markets and diaspora.",
		"dietary_classifications": ["vegan", "contains gluten (flatbread)"]
	},
	{
		"id": "31",
		"name": "Bibimbap",
		"category_group": "International",
		"category": "Main Course",
		"origin": "Korea",
		"description": "Bibimbap layers rice with assorted seasoned vegetables, gochujang, and often a fried egg or sliced beef. The dish celebrates balance and color, encouraging mixing for harmony of flavors and textures. It’s a versatile bowl embodying Korean home cooking and temple cuisine roots.",
		"ingredients": ["rice", "spinach", "bean sprouts", "carrots", "zucchini", "shiitake", "beef (optional)", "egg (optional)", "gochujang"],
		"preparation_method": "Prepare and season vegetables individually, assemble over rice, top with egg or beef, and serve with gochujang to mix.",
		"nutritional_highlights": "Balanced macros, fiber, and phytonutrients; adjust spice and protein to dietary needs.",
		"cultural_significance": "Represents Korean principles of balance, color, and communal dining.",
		"dietary_classifications": ["vegetarian (without beef)", "contains gluten (some gochujang)"]
	},
	{
		"id": "32",
		"name": "Paella Valenciana",
		"category_group": "International",
		"category": "Main Course",
		"origin": "Spain",
		"description": "Paella Valenciana cooks rice in a wide pan with rabbit, chicken, green beans, and saffron, developing socarrat—the prized crust. It reflects communal outdoor cooking and regional pride. Internationally, seafood versions are common, but the original emphasizes land ingredients and saffron’s floral aroma.",
		"ingredients": ["short-grain rice", "rabbit", "chicken", "green beans", "garrofó (lima beans)", "tomato", "saffron", "olive oil"],
		"preparation_method": "Sear meats, sauté sofrito, add stock and rice without stirring much, cook until socarrat forms.",
		"nutritional_highlights": "Complex carbs with protein; saffron contains antioxidant compounds; moderate portion keeps balance.",
		"cultural_significance": "A Valencian emblem of Sunday gatherings and outdoor paelleras.",
		"dietary_classifications": ["contains meat", "gluten-free"]
	},
	{
		"id": "33",
		"name": "Tagine with Apricots and Almonds",
		"category_group": "International",
		"category": "Stew",
		"origin": "Morocco",
		"description": "A slow-cooked tagine of lamb or chicken with onions, spices, apricots, and almonds yields a sweet-savory sauce. The conical lid condenses steam, returning moisture to the dish. It’s aromatic, tender, and celebratory, reflecting North African spice trade.",
		"ingredients": ["lamb or chicken", "onions", "ginger", "cinnamon", "turmeric", "apricots", "almonds", "honey"],
		"preparation_method": "Brown meat, add aromatics and spices, slow-cook covered with dried fruit until tender; finish with nuts and herbs.",
		"nutritional_highlights": "Protein, healthy fats, micronutrients; dried fruit raises sugars—pair with whole grains.",
		"cultural_significance": "Reflects communal sharing and spice-route influences.",
		"dietary_classifications": ["gluten-free"]
	},
	{
		"id": "34",
		"name": "Jollof Rice",
		"category_group": "International",
		"category": "Main Course",
		"origin": "West Africa",
		"description": "Jollof Rice is a vibrant one-pot dish of rice cooked in tomato-pepper puree with spices, often served with chicken or fish. It’s central to social gatherings and friendly regional debates over origin and best method, uniting flavors across the West African coast.",
		"ingredients": ["rice", "tomatoes", "red peppers", "onion", "garlic", "thyme", "stock", "oil"],
		"preparation_method": "Blend tomatoes and peppers, cook down into a stew base, add rice and stock, steam until fluffy.",
		"nutritional_highlights": "Energy-rich; pair with vegetables and lean proteins for balance.",
		"cultural_significance": "A festive staple sparking friendly culinary rivalries and pride.",
		"dietary_classifications": ["vegetarian (without meat)", "gluten-free"]
	},
	{
		"id": "35",
		"name": "Pho",
		"category_group": "International",
		"category": "Soup",
		"origin": "Vietnam",
		"description": "Pho features aromatic broth simmered with charred onion and ginger, spices like star anise and cinnamon, and rice noodles, topped with herbs and thinly sliced beef or chicken. Its clarity and aroma define the experience, offering comfort and freshness.",
		"ingredients": ["beef or chicken bones", "onion", "ginger", "star anise", "cinnamon", "fish sauce", "rice noodles", "herbs"],
		"preparation_method": "Char aromatics, simmer bones long for clear broth, season, cook noodles separately, and assemble with herbs and protein.",
		"nutritional_highlights": "Hydrating, protein-rich, low fat if skimmed; herbs add antioxidants.",
		"cultural_significance": "A national dish bridging street stalls and home kitchens.",
		"dietary_classifications": ["gluten-free"]
	},
	{
		"id": "36",
		"name": "Shakshuka",
		"category_group": "International",
		"category": "Breakfast",
		"origin": "North Africa/Middle East",
		"description": "Shakshuka poaches eggs in a spiced tomato-pepper sauce with onions and garlic, often finished with feta and herbs. It’s hearty yet bright, ideal for brunch or dinner, and popularized globally through cafes and home cooks.",
		"ingredients": ["eggs", "tomatoes", "red peppers", "onion", "garlic", "cumin", "paprika", "feta (optional)"],
		"preparation_method": "Sauté aromatics, simmer tomatoes into a sauce, make wells, crack eggs, cover to set whites, and garnish.",
		"nutritional_highlights": "Protein, choline, lycopene; adjust spice and cheese for dietary needs.",
		"cultural_significance": "Represents Maghrebi-Israeli comfort food and communal skillet dining.",
		"dietary_classifications": ["vegetarian", "gluten-free"]
	},
	{
		"id": "37",
		"name": "Ceviche",
		"category_group": "International",
		"category": "Starter",
		"origin": "Peru",
		"description": "Ceviche cures fresh fish in citrus juice with onion, chilies, and cilantro, served chilled. The acid denatures proteins, creating a delicate texture and bright flavor. It’s a coastal classic emphasizing freshness and restraint.",
		"ingredients": ["firm white fish", "lime juice", "red onion", "aji or chili", "cilantro", "salt"],
		"preparation_method": "Dice fish, marinate briefly in lime until opaque, drain lightly, and toss with aromatics.",
		"nutritional_highlights": "Lean protein, vitamin C, low fat; ensure food safety with fresh seafood.",
		"cultural_significance": "Embodies Peruvian coastal cuisine and national pride.",
		"dietary_classifications": ["gluten-free", "pescatarian"]
	},
	{
		"id": "38",
		"name": "Ratatouille",
		"category_group": "International",
		"category": "Vegetable Main",
		"origin": "France",
		"description": "Ratatouille stews summer vegetables—eggplant, zucchini, peppers, and tomatoes—until tender, achieving rustic harmony. It’s a celebration of produce and Provençal herbs, served as a side or vegetarian main. The dish communicates simplicity and seasonality.",
		"ingredients": ["eggplant", "zucchini", "bell peppers", "tomatoes", "onion", "garlic", "herbes de Provence", "olive oil"],
		"preparation_method": "Sauté vegetables in batches, combine with tomatoes and herbs, simmer until flavors meld.",
		"nutritional_highlights": "Low calorie, fiber-rich, antioxidant-packed; excellent for plant-forward diets.",
		"cultural_significance": "A Provençal staple highlighting garden abundance.",
		"dietary_classifications": ["vegan", "gluten-free"]
	},
	{
		"id": "39",
		"name": "Kimchi Fried Rice",
		"category_group": "International",
		"category": "Main Course",
		"origin": "Korea",
		"description": "Kimchi fried rice transforms day-old rice with fermented kimchi, aromatics, and often a fried egg or pork bits. The wok technique yields smoky notes and savory tang. It’s a resourceful comfort food celebrating fermentation and home-cooking practicality.",
		"ingredients": ["rice", "kimchi", "gochujang (optional)", "scallions", "garlic", "egg (optional)", "pork (optional)", "sesame oil"],
		"preparation_method": "Stir-fry aromatics, add kimchi and rice, season with gochujang and sesame oil, top with egg.",
		"nutritional_highlights": "Carbs with probiotics from kimchi; add vegetables and lean protein for balance.",
		"cultural_significance": "A beloved pantry meal utilizing leftovers and fermentation.",
		"dietary_classifications": ["vegetarian (without pork)", "contains gluten (some gochujang)"]
	},
	{
		"id": "40",
		"name": "Baklava",
		"category_group": "International",
		"category": "Dessert",
		"origin": "Turkey/Levant",
		"description": "Baklava layers thin phyllo pastry with nuts and fragrant syrup, achieving a crisp, honeyed sweetness. Precision in buttering and baking yields flaky texture. Celebratory and rich, it’s shared during holidays and special occasions across regions.",
		"ingredients": ["phyllo", "walnuts or pistachios", "butter", "sugar", "honey", "lemon", "cinnamon"],
		"preparation_method": "Layer phyllo with nuts and butter, bake until golden, pour hot syrup to soak.",
		"nutritional_highlights": "Energy-dense; provides healthy fats from nuts; enjoy in modest portions.",
		"cultural_significance": "Symbolizes hospitality and festive generosity across the Levant and Anatolia.",
		"dietary_classifications": ["vegetarian", "contains gluten"]
	},
	{
		"id": "41",
		"name": "Pasta Carbonara",
		"category_group": "International",
		"category": "Main Course",
		"origin": "Italy",
		"description": "Carbonara coats spaghetti with a silky emulsion of eggs, pecorino or parmesan, and guanciale, thickened by residual heat. The technique avoids cream, relying on timing and texture. It exemplifies Roman tradition and global pasta culture.",
		"ingredients": ["spaghetti", "guanciale", "eggs", "pecorino", "black pepper", "salt"],
		"preparation_method": "Render guanciale, boil pasta al dente, toss off-heat with egg-cheese mixture and pasta water to create a glossy sauce.",
		"nutritional_highlights": "Protein and calcium; high sodium and fat—balance with salad and portion control.",
		"cultural_significance": "A Roman classic debated for authenticity and technique.",
		"dietary_classifications": ["contains gluten", "contains pork"]
	},
	{
		"id": "42",
		"name": "Hamburger",
		"category_group": "International",
		"category": "Main Course",
		"origin": "United States",
		"description": "A ground beef patty grilled or griddled, served on a bun with condiments and toppings. It spans styles from diner smashburgers to gourmet creations. The hamburger’s ubiquity symbolizes fast food culture and culinary customization across the world.",
		"ingredients": ["ground beef", "bun", "lettuce", "tomato", "onion", "cheese (optional)", "pickles", "condiments"],
		"preparation_method": "Season and sear patty to desired doneness, toast bun, assemble with toppings.",
		"nutritional_highlights": "High protein; choose lean beef, whole-grain buns, and vegetables to improve nutrient density.",
		"cultural_significance": "An icon of American dining, from backyard grills to chains.",
		"dietary_classifications": ["contains gluten", "can be dairy-free"]
	},
	{
		"id": "43",
		"name": "Feijoada",
		"category_group": "International",
		"category": "Stew",
		"origin": "Brazil",
		"description": "Feijoada is a hearty black bean stew simmered with assorted pork cuts and served with rice, collard greens, and orange slices. Slow cooking melds flavors into a comforting, communal meal often reserved for weekends. It reflects colonial history and regional adaptations.",
		"ingredients": ["black beans", "pork", "sausages", "onion", "garlic", "bay leaves", "rice", "collards"],
		"preparation_method": "Soak beans, simmer with pork and aromatics until tender, skim fat, and serve with traditional sides.",
		"nutritional_highlights": "Fiber and protein from beans; high sodium and fat from pork—moderate intake and add greens.",
		"cultural_significance": "A national comfort dish uniting families and communities.",
		"dietary_classifications": ["contains pork", "gluten-free"]
	}
]
